# Pandas_Concat_Append_Merge

In [1]:
import pandas as pd
import numpy as np

## 1. The ``concat()`` method

### A. Series

In [2]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])

In [3]:
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

### B. Dataframe

In [4]:
df1 = pd.DataFrame([[1,  0, 2],
                    [2,  3, 5],
                    [3 , 4, 6]])

df1

   0  1  2
0  1  0  2
1  2  3  5
2  3  4  6

In [5]:
df2 = pd.DataFrame([['a','b','c'],['d','e','f'],['g','h','i']])
df2

   0  1  2
0  a  b  c
1  d  e  f
2  g  h  i

In [6]:
pd.concat([df1, df2], axis=1)

   0  1  2  0  1  2
0  1  0  2  a  b  c
1  2  3  5  d  e  f
2  3  4  6  g  h  i

In [7]:
pd.concat([df1, df2], axis=0)

   0  1  2
0  1  0  2
1  2  3  5
2  3  4  6
0  a  b  c
1  d  e  f
2  g  h  i

In [8]:
# Ignoring index

pd.concat([df1, df2], axis=0, ignore_index=True )

   0  1  2
0  1  0  2
1  2  3  5
2  3  4  6
3  a  b  c
4  d  e  f
5  g  h  i

### Adding MultiIndex keys

In [9]:
pd.concat([df1, df2], keys=['df1', 'df2'] )               #Try with axis 1

       0  1  2
df1 0  1  0  2
    1  2  3  5
    2  3  4  6
df2 0  a  b  c
    1  d  e  f
    2  g  h  i

In [10]:
pd.concat([df1,df2], keys = ['df1','df2'], axis = 1 )

  df1       df2
    0  1  2   0  1  2
0   1  0  2   a  b  c
1   2  3  5   d  e  f
2   3  4  6   g  h  i

## 2. The ``append()`` method

In [11]:
df2.append(df1)

   0  1  2
0  a  b  c
1  d  e  f
2  g  h  i
0  1  0  2
1  2  3  5
2  3  4  6

## 3. The ``merge()`` method

In [12]:
frame1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

frame2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [13]:
frame1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [14]:
frame2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

###  A. The ``on`` keyword

In [15]:
df1 = pd.merge(frame1, frame2, on='employee')

df1

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

### B. The ``left_on`` and ``right_on`` keywords

In [16]:
df2 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

df2

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [17]:
df1

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [18]:
pd.merge(df1, df2, left_on="employee", right_on="name")

  employee        group  hire_date  name  salary
0      Bob   Accounting       2008   Bob   70000
1     Jake  Engineering       2012  Jake   80000
2     Lisa  Engineering       2004  Lisa  120000
3      Sue           HR       2014   Sue   90000

In [21]:
pd.merge?

<img src = "https://cdn.mindmajix.com/blog/images/db-01_2119.png" width = 700, height = 700 >

In [22]:
df3 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df4 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

In [23]:
df3

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [24]:
df4

     name drink
0    Mary  wine
1  Joseph  beer

### C. The ``how`` keywords

In [25]:
pd.merge(df3, df4, how='inner')

   name   food drink
0  Mary  bread  wine

In [26]:
pd.merge(df3, df4, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [27]:
pd.merge(df3,df4, how='right' )

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer